{
"courses": [
{
"id": 1,
"code": "CMPE 100",
"name": "Introduction to Computing",
"description": "The aim of this course is to introduce fundamental computing concepts to first year college students. The course focuses on working in teams, group functioning, designing programming, use functional programming, and how to effectively use computers.",
"keywords": "computing basics, binary, algorithms, hardware and software, data representation, internet, security, spreadsheets, databases, AI, ethics",
"content": [
{
"week_number": 1,
"topic": "What is Computing? History of computers, hardware vs. software, binary representation"
},
{
"week_number": 2,
"topic": "How Computers Work — CPU, memory, storage, I/O devices, operating systems basics"
},
{
"week_number": 3,
"topic": "Digital Information — Data representation, bits and bytes, text encoding, digital images"
},
{
"week_number": 4,
"topic": "Introduction to Algorithms — Problem-solving, flowcharts, pseudocode, step-by-step thinking"
},
{
"week_number": 5,
"topic": "Introduction to Programming Concepts — Variables, basic data types, simple expressions"
},
{
"week_number": 6,
"topic": "Control Structures — Conditionals (if/else), simple loops, logical thinking"
},
{
"week_number": 7,
"topic": "Functions and Modularity — Breaking problems into smaller parts, code reuse basics"
},
{
"week_number": 8,
"topic": "Data Organization — Lists, simple data structures, working with collections"
},
{
"week_number": 9,
"topic": "Networks and the Internet — How the internet works, protocols, web basics, URLs, browsers"
},
{
"week_number": 10,
"topic": "Computer Security and Privacy — Passwords, encryption basics, online safety, privacy concerns"
},
{
"week_number": 11,
"topic": "Spreadsheets and Data Analysis — Using spreadsheets for computation, formulas, basic charts"
},
{
"week_number": 12,
"topic": "Databases and Information Management — How data is stored and retrieved, basic queries"
},
{
"week_number": 13,
"topic": "Artificial Intelligence and Current Topics — Machine learning basics, AI applications, ethics"
},
{
"week_number": 14,
"topic": "Computing in Society — Social impact of computing, career paths, course review"
}
]
},
{
"id": 2,
"code": "CMPE 101",
"name": "Introduction to Object-Oriented Programming",
"description": "This course introduces the fundamentals of Object-Oriented Programming (OOP) using Java, covering core concepts such as classes, methods, encapsulation, inheritance, and polymorphism. Students will develop problem-solving skills through hands-on exercises.",
"keywords": "Java, object-oriented programming, classes, inheritance, polymorphism, arrays, exceptions, file I/O",
"content": [
{
"week_number": 1,
"topic": "Introduction to Java — JVM, IDE setup, first program, compilation, basic syntax"
},
{
"week_number": 2,
"topic": "Variables and Data Types — Primitive types, declarations, type casting, operators"
},
{
"week_number": 3,
"topic": "Expressions and Basic I/O — Arithmetic expressions, Scanner for input, print statements"
},
{
"week_number": 4,
"topic": "Control Flow I — Conditional statements (if, if-else, switch), boolean expressions"
},
{
"week_number": 5,
"topic": "Control Flow II — Loops (for, while, do-while), nested control structures"
},
{
"week_number": 6,
"topic": "Methods — Defining methods, parameters, return values, method overloading"
},
{
"week_number": 7,
"topic": "Introduction to Classes and Objects — Class design, instance variables, constructors, this keyword"
},
{
"week_number": 8,
"topic": "Object-Oriented Design — Encapsulation, access modifiers, getters/setters, object interaction"
},
{
"week_number": 9,
"topic": "Arrays — Array declaration, initialization, traversal, arrays of objects, ArrayList introduction"
},
{
"week_number": 10,
"topic": "Inheritance — Superclasses/subclasses, extends keyword, method overriding, super keyword"
},
{
"week_number": 11,
"topic": "Polymorphism and Abstract Classes — Dynamic binding, abstract methods, designing class hierarchies"
},
{
"week_number": 12,
"topic": "Interfaces and Packages — Interface definition, implementing interfaces, organizing code in packages"
},
{
"week_number": 13,
"topic": "Exception Handling — Try-catch blocks, throwing exceptions, checked vs. unchecked exceptions"
},
{
"week_number": 14,
"topic": "File I/O and Course Review — Reading/writing files, streams, comprehensive review"
}
]
},
{
"id": 3,
"code": "CMPE 102",
"name": "Introduction to Programming with Python",
"description": "This course aims to equip engineering students who are not specializing in computing with the necessary skills to design and implement simple computer programs of practical use in Python to solve mathematical and scientific problems.",
"keywords": "Python, introductory programming, control flow, functions, lists, dictionaries, OOP basics",
"content": [
{
"week_number": 1,
"topic": "Introduction to Computing and Python — What is programming, Python setup, first program, print statements"
},
{
"week_number": 2,
"topic": "Variables and Data Types — Integers, floats, strings, booleans, type conversion, basic operators"
},
{
"week_number": 3,
"topic": "Expressions and User Input — Arithmetic expressions, input function, string operations"
},
{
"week_number": 4,
"topic": "Control Flow I — Conditional statements (if, elif, else), boolean logic, comparison operators"
},
{
"week_number": 5,
"topic": "Control Flow II — While loops, for loops, range function, loop patterns, break/continue"
},
{
"week_number": 6,
"topic": "Functions — Defining functions, parameters, return values, scope, docstrings"
},
{
"week_number": 7,
"topic": "Strings and String Processing — String methods, slicing, formatting, text manipulation"
},
{
"week_number": 8,
"topic": "Lists — List creation, indexing, slicing, list methods, iteration over lists"
},
{
"week_number": 9,
"topic": "Tuples and Dictionaries — Immutable sequences, key-value pairs, dictionary operations"
},
{
"week_number": 10,
"topic": "File I/O — Opening files, reading/writing, file handling patterns, CSV files"
},
{
"week_number": 11,
"topic": "Testing and Debugging — Testing strategies, debugging techniques, assertions, common errors"
},
{
"week_number": 12,
"topic": "Object-Oriented Programming Basics — Classes, objects, init, instance methods, self"
},
{
"week_number": 13,
"topic": "More OOP and Modules — Inheritance basics, importing modules, using standard libraries"
},
{
"week_number": 14,
"topic": "Algorithm Efficiency and Review — Big-O introduction, searching, sorting basics, course review"
}
]
},
{
"id": 4,
"code": "CMPE 150",
"name": "Discrete Mathematics for Computer Science",
"description": "Bu ders, temel matematik tanımlarını ve bilgisayar bilimleri ve mühendislik uygulamalarını kapsamaktadır. Bu dersin sonunda öğrenciler, teorik matematik ile pratik bilgisayar bilimleri ve mühendisliği arasındaki ilişki ile donanmış olurlar.",
"keywords": "discrete mathematics, logic, sets, functions, relations, induction, counting, probability, graph theory",
"content": [
{
"week_number": 1,
"topic": "Propositional Logic I — Propositions, logical connectives (AND, OR, NOT), truth tables"
},
{
"week_number": 2,
"topic": "Propositional Logic II — Logical equivalence, implications, contrapositive, normal forms"
},
{
"week_number": 3,
"topic": "Predicate Logic — Predicates, quantifiers (universal, existential), nested quantifiers"
},
{
"week_number": 4,
"topic": "Proof Techniques I — Direct proof, proof by contraposition, proof by contradiction"
},
{
"week_number": 5,
"topic": "Proof Techniques II — Proof by cases, existence proofs, constructive vs. non-constructive"
},
{
"week_number": 6,
"topic": "Sets and Set Operations — Set notation, subsets, union, intersection, complement, power sets"
},
{
"week_number": 7,
"topic": "Functions — One-to-one, onto, bijections, inverse functions, composition"
},
{
"week_number": 8,
"topic": "Relations — Properties of relations, equivalence relations, partial orderings"
},
{
"week_number": 9,
"topic": "Mathematical Induction — Weak induction, strong induction, well-ordering principle"
},
{
"week_number": 10,
"topic": "Recursion and Recurrence Relations — Recursive definitions, solving recurrences"
},
{
"week_number": 11,
"topic": "Counting I — Basic counting principles, sum rule, product rule, pigeonhole principle"
},
{
"week_number": 12,
"topic": "Counting II — Permutations, combinations, binomial coefficients, Pascal's triangle"
},
{
"week_number": 13,
"topic": "Introduction to Probability — Sample spaces, events, conditional probability, Bayes' theorem"
},
{
"week_number": 14,
"topic": "Graph Theory Basics — Graph terminology, types of graphs, paths, connectivity, trees"
}
]
},
{
"id": 5,
"code": "CMPE 211",
"name": "Data Structures and Algorithms",
"description": "This course covers the basic science behind the use of computers to provide effective and efficient methods for carrying out tasks. This course introduces the basic sorting and searching methods and dynamic data structures such as linked lists, trees and hash tables.",
"keywords": "data structures, algorithms, complexity, arrays, linked lists, trees, graphs, sorting, hashing",
"content": [
{
"week_number": 1,
"topic": "Introduction to Algorithms and Complexity Analysis — Big-O, Big-Omega, Big-Theta notation"
},
{
"week_number": 2,
"topic": "Arrays, Dynamic Arrays, and Amortized Analysis"
},
{
"week_number": 3,
"topic": "Linked Lists (Singly, Doubly, Circular) and Abstract Data Types"
},
{
"week_number": 4,
"topic": "Stacks, Queues, and Deques"
},
{
"week_number": 5,
"topic": "Recursion and Basic Sorting — Bubble sort, selection sort, insertion sort"
},
{
"week_number": 6,
"topic": "Divide-and-Conquer — Merge sort and quicksort"
},
{
"week_number": 7,
"topic": "Binary Trees — Tree traversals and binary search trees"
},
{
"week_number": 8,
"topic": "Balanced Trees — AVL trees, red-black trees"
},
{
"week_number": 9,
"topic": "Heaps and Priority Queues"
},
{
"week_number": 10,
"topic": "Hash Tables — Hash functions and collision resolution"
},
{
"week_number": 11,
"topic": "Introduction to Graphs — Representations, BFS, and DFS"
},
{
"week_number": 12,
"topic": "Graph Applications — Topological sort and connected components"
},
{
"week_number": 13,
"topic": "Shortest Path Algorithms — Dijkstra's, Bellman-Ford"
},
{
"week_number": 14,
"topic": "Minimum Spanning Trees — Prim's, Kruskal's algorithms, course review"
}
]
},
{
"id": 6,
"code": "CMPE 220",
"name": "Modern DevOps Practices",
"description": "In this course on Modern DevOps Practices, students dive deep into the transformative methodologies that are revolutionizing how development and operations teams collaborate. This course provides a practical understanding of how to implement and leverage modern DevOps practices.",
"keywords": "DevOps, CI/CD, Docker, Kubernetes, Terraform, Ansible, monitoring, cloud, automation",
"content": [
{
"week_number": 1,
"topic": "Introduction to DevOps — Philosophy, culture, principles, Dev/Ops collaboration"
},
{
"week_number": 2,
"topic": "Linux Fundamentals — Command-line navigation, shell scripting, system monitoring"
},
{
"week_number": 3,
"topic": "Version Control with Git — Branching strategies, merging, pull requests, Git workflows"
},
{
"week_number": 4,
"topic": "Continuous Integration — CI principles, build automation, Jenkins/GitHub Actions"
},
{
"week_number": 5,
"topic": "Continuous Delivery and Deployment — CD pipelines, deployment strategies (blue-green, canary)"
},
{
"week_number": 6,
"topic": "Containerization with Docker — Container basics, Dockerfiles, images, volumes, multi-stage builds"
},
{
"week_number": 7,
"topic": "Docker Compose — Multi-container applications, YAML configuration, Docker networking"
},
{
"week_number": 8,
"topic": "Kubernetes Fundamentals — Architecture, pods, services, deployments, kubectl"
},
{
"week_number": 9,
"topic": "Advanced Kubernetes — ConfigMaps, secrets, persistent volumes, Helm charts"
},
{
"week_number": 10,
"topic": "Infrastructure as Code with Terraform — IaC principles, configuration, state management"
},
{
"week_number": 11,
"topic": "Configuration Management with Ansible — Playbooks, inventory, roles, idempotency"
},
{
"week_number": 12,
"topic": "Cloud Platforms for DevOps — AWS/Azure/GCP DevOps services"
},
{
"week_number": 13,
"topic": "Monitoring and Observability — Prometheus, Grafana, ELK stack, SRE principles"
},
{
"week_number": 14,
"topic": "DevOps Security and Best Practices — DevSecOps, container security, secrets management"
}
]
},
{
"id": 7,
"code": "CMPE 223",
"name": "Theory of Computation",
"description": "This course teaches regular languages, context-free languages and the automata related to these: finite-state automata and push-down automata. The machinery are explained and studied mathematically. Also, regular grammars and context-free grammars and regular expressions are studied extensively.",
"keywords": "theory of computation, automata, regular languages, context-free languages, Turing machines, decidability, complexity, NP-completeness",
"content": [
{
"week_number": 1,
"topic": "Introduction to Theory of Computation — Mathematical preliminaries and proof techniques"
},
{
"week_number": 2,
"topic": "Finite Automata — Deterministic Finite Automata (DFA)"
},
{
"week_number": 3,
"topic": "Nondeterministic Finite Automata (NFA) — NFA-DFA equivalence"
},
{
"week_number": 4,
"topic": "Regular Expressions — Regular languages and closure properties"
},
{
"week_number": 5,
"topic": "Pumping Lemma for Regular Languages — Non-regular languages"
},
{
"week_number": 6,
"topic": "Context-Free Grammars (CFG) — Parse trees, ambiguity"
},
{
"week_number": 7,
"topic": "Pushdown Automata (PDA) — CFG-PDA equivalence"
},
{
"week_number": 8,
"topic": "Pumping Lemma for Context-Free Languages — Closure properties of CFLs"
},
{
"week_number": 9,
"topic": "Turing Machines — Definition, variants, and Church-Turing thesis"
},
{
"week_number": 10,
"topic": "Decidability — Decidable languages, the Halting Problem"
},
{
"week_number": 11,
"topic": "Reducibility — Rice's theorem, undecidable problems"
},
{
"week_number": 12,
"topic": "Time Complexity — P and NP, polynomial-time reducibility"
},
{
"week_number": 13,
"topic": "NP-Completeness — Cook-Levin theorem, NP-complete problems"
},
{
"week_number": 14,
"topic": "Space Complexity (PSPACE) — Course review"
}
]
},
{
"id": 8,
"code": "CMPE 250",
"name": "Advanced Data Structures and Algorithms",
"description": "This course builds on CMPE 211 to apply similar techniques to analyse more sophisticated algorithms and data structures. Topics covered include graphs and graph algorithms, greedy algorithms, random algorithms, divide and conquer algorithms, dynamic programming and string searching algorithms.",
"keywords": "advanced algorithms, dynamic programming, network flow, NP-hard, approximation algorithms, randomized algorithms",
"content": [
{
"week_number": 1,
"topic": "Review of Asymptotic Analysis — Recurrences and the Master Theorem"
},
{
"week_number": 2,
"topic": "Amortized Analysis — Aggregate, accounting, potential methods"
},
{
"week_number": 3,
"topic": "Dynamic Programming I — Principles, memoization vs. tabulation"
},
{
"week_number": 4,
"topic": "Dynamic Programming II — Classic problems (LCS, edit distance, knapsack)"
},
{
"week_number": 5,
"topic": "Advanced Graph Algorithms — Strongly connected components, all-pairs shortest paths"
},
{
"week_number": 6,
"topic": "Network Flow I — Ford-Fulkerson, max-flow min-cut theorem"
},
{
"week_number": 7,
"topic": "Network Flow II — Applications (bipartite matching, minimum cut)"
},
{
"week_number": 8,
"topic": "Linear Programming — Formulation, duality, and simplex overview"
},
{
"week_number": 9,
"topic": "NP-Completeness — Formal definitions, reductions, proving NP-completeness"
},
{
"week_number": 10,
"topic": "Coping with NP-Hardness — Backtracking, branch-and-bound"
},
{
"week_number": 11,
"topic": "Approximation Algorithms I — Vertex cover, set cover, TSP"
},
{
"week_number": 12,
"topic": "Approximation Algorithms II — Approximation schemes (PTAS, FPTAS)"
},
{
"week_number": 13,
"topic": "Randomized Algorithms — Las Vegas vs. Monte Carlo, randomized quicksort, min-cut"
},
{
"week_number": 14,
"topic": "Advanced Topics — String matching or computational geometry, course review"
}
]
},
{
"id": 9,
"code": "CMPE 258",
"name": "Data Science and Social Media Analysis",
"description": "This course aims to provide students with a general understanding of data science and social media analysis, including their design. In addition, the design processes for and programming used in developing such systems will be addressed.",
"keywords": "data science, social media, APIs, network analysis, sentiment analysis, topic modeling, ethics",
"content": [
{
"week_number": 1,
"topic": "Introduction to Social Media Data Science — Data types, structured vs. unstructured data"
},
{
"week_number": 2,
"topic": "Social Media APIs and Data Collection — Working with Twitter, Reddit, YouTube APIs"
},
{
"week_number": 3,
"topic": "Data Storage and Management — NoSQL databases, JSON handling, data preprocessing"
},
{
"week_number": 4,
"topic": "Exploratory Data Analysis — Summary statistics, temporal patterns, geographic analysis"
},
{
"week_number": 5,
"topic": "Network Fundamentals — Graph theory basics, social network representations"
},
{
"week_number": 6,
"topic": "Network Analysis Metrics — Centrality measures (degree, betweenness, closeness)"
},
{
"week_number": 7,
"topic": "Community Detection and Clustering — Graph clustering algorithms, modularity"
},
{
"week_number": 8,
"topic": "Midterm Exam and Review"
},
{
"week_number": 9,
"topic": "Text Processing Fundamentals — Tokenization, stemming, lemmatization, TF-IDF"
},
{
"week_number": 10,
"topic": "Sentiment Analysis — Lexicon-based approaches, machine learning classifiers"
},
{
"week_number": 11,
"topic": "Topic Modeling — LDA, topic extraction over time, hashtag analysis"
},
{
"week_number": 12,
"topic": "Influence and Virality — Information diffusion, influencer identification"
},
{
"week_number": 13,
"topic": "Ethical Considerations — Privacy, consent, data governance, research ethics"
},
{
"week_number": 14,
"topic": "Final Project Presentations and Course Wrap-up"
}
]
},
{
"id": 10,
"code": "CMPE 260",
"name": "Concurrent Programming",
"description": "This course offers an exploration of the widely used programming languages C++, Python, and Java, focusing on their unique strengths and areas of application. Students will delve into topics such as object-oriented programming, concurrency, concurrent process design, critical section access, mutual exclusion, threads, semaphores, and sockets.",
"keywords": "concurrency, threads, synchronization, locks, semaphores, deadlock, parallel programming, memory models",
"content": [
{
"week_number": 1,
"topic": "Introduction to Concurrency — Motivation, processes vs. threads, safety and liveness properties"
},
{
"week_number": 2,
"topic": "Thread Fundamentals — Thread creation, Java threads, Python threading, POSIX threads"
},
{
"week_number": 3,
"topic": "Shared Memory and Race Conditions — Shared data problems, atomicity, critical sections"
},
{
"week_number": 4,
"topic": "Mutual Exclusion — Peterson's algorithm, test-and-set, compare-and-swap"
},
{
"week_number": 5,
"topic": "Locks and Lock-based Synchronization — Mutex locks, reentrant locks, reader-writer locks"
},
{
"week_number": 6,
"topic": "Semaphores — Counting and binary semaphores, producer-consumer problem"
},
{
"week_number": 7,
"topic": "Monitors and Condition Variables — Monitor concept, Java synchronized, wait/notify"
},
{
"week_number": 8,
"topic": "Midterm Exam and Review"
},
{
"week_number": 9,
"topic": "Deadlock and Livelock — Deadlock conditions, prevention, detection, recovery"
},
{
"week_number": 10,
"topic": "Concurrent Data Structures — Thread-safe collections, lock-free data structures"
},
{
"week_number": 11,
"topic": "Parallel Programming Patterns — Fork-join, map-reduce, OpenMP basics, thread pools"
},
{
"week_number": 12,
"topic": "Memory Models and Atomics — Java memory model, happens-before, volatile, memory barriers"
},
{
"week_number": 13,
"topic": "Actor Model and Message Passing — Actor-based concurrency, async programming patterns"
},
{
"week_number": 14,
"topic": "Advanced Topics and Project Presentations — Transactional memory, parallel algorithm design"
}
]
},
{
"id": 11,
"code": "CMPE 283",
"name": "Cloud Programming",
"description": "Programs running on the cloud to provide services to users or computers elsewhere are becoming increasingly important. This course looks at the issues involved in writing service-providing programs, using the latest programming languages and technology.",
"keywords": "cloud programming, microservices, REST APIs, serverless, containers, message queues, observability, security",
"content": [
{
"week_number": 1,
"topic": "Introduction to Cloud-Native Development — Cloud computing overview, 12-factor app methodology"
},
{
"week_number": 2,
"topic": "Cloud Service Models — IaaS, PaaS, SaaS, FaaS comparison"
},
{
"week_number": 3,
"topic": "Microservices Architecture — Monolith vs. microservices, decomposition strategies"
},
{
"week_number": 4,
"topic": "RESTful API Design — REST principles, API design best practices, Flask/Express"
},
{
"week_number": 5,
"topic": "API Documentation and Testing — OpenAPI/Swagger, API testing with Postman"
},
{
"week_number": 6,
"topic": "Containerizing Cloud Applications — Docker for microservices, image optimization"
},
{
"week_number": 7,
"topic": "Service Communication Patterns — Synchronous vs. asynchronous, API gateways"
},
{
"week_number": 8,
"topic": "Serverless Computing Fundamentals — AWS Lambda, Azure Functions, Google Cloud Functions"
},
{
"week_number": 9,
"topic": "Serverless Application Development — Event-driven functions, triggers, cold starts"
},
{
"week_number": 10,
"topic": "Message Queues and Event-Driven Architecture — Kafka, RabbitMQ, SQS, pub/sub patterns"
},
{
"week_number": 11,
"topic": "Container Orchestration for Microservices — Kubernetes, service mesh (Istio)"
},
{
"week_number": 12,
"topic": "Cloud Database Services — Managed databases, NoSQL, database-per-service pattern"
},
{
"week_number": 13,
"topic": "Observability in Cloud Applications — Distributed tracing, logging, OpenTelemetry"
},
{
"week_number": 14,
"topic": "Cloud Application Security — OAuth/JWT authentication, secrets management, final project"
}
]
},
{
"id": 12,
"code": "CMPE 322",
"name": "Data Engineering",
"description": "In this course, students will learn about many engineering tasks related to data. Students will specialize in many topics such as data visualization, data analysis, linear regression, and modeling. These topics will be reinforced with both theoretical and practical examples.",
"keywords": "data engineering, data pipelines, ETL, SQL, data lakes, data warehouses, Spark, Airflow, governance",
"content": [
{
"week_number": 1,
"topic": "Introduction to Data Engineering — Role of data engineers, modern data stack overview"
},
{
"week_number": 2,
"topic": "Data Pipeline Fundamentals — End-to-end architecture, batch vs. streaming"
},
{
"week_number": 3,
"topic": "SQL Review and Advanced Queries — Aggregate functions, joins, window functions"
},
{
"week_number": 4,
"topic": "Source Systems and Data Ingestion — Operational databases, APIs, file formats (CSV, JSON, Parquet)"
},
{
"week_number": 5,
"topic": "Data Lakes and Data Warehouses — Architecture comparison, data lakehouses"
},
{
"week_number": 6,
"topic": "Data Modeling for Analytics — ER diagrams, dimensional modeling, star schema"
},
{
"week_number": 7,
"topic": "ETL/ELT Processes — Extract, Transform, Load patterns, dbt"
},
{
"week_number": 8,
"topic": "Midterm Exam and Review"
},
{
"week_number": 9,
"topic": "Big Data Fundamentals — Hadoop ecosystem, HDFS, MapReduce concepts"
},
{
"week_number": 10,
"topic": "Apache Spark — Spark architecture, RDDs, DataFrames, PySpark basics"
},
{
"week_number": 11,
"topic": "Data Quality and Profiling — Data validation, quality metrics, handling missing data"
},
{
"week_number": 12,
"topic": "Data Orchestration and Scheduling — Workflow orchestration, Apache Airflow"
},
{
"week_number": 13,
"topic": "Data Governance and Catalogs — Metadata management, data lineage, compliance"
},
{
"week_number": 14,
"topic": "Final Project Presentations — End-to-end pipeline demonstration"
}
]
},
{
"id": 13,
"code": "CMPE 462",
"name": "Machine Learning",
"description": "Machine learning concerns the construction of systems that can learn from data. This course covers the theory and practical algorithms for machine learning focusing on classification, clustering, dimensionality reduction and reinforcement learning.",
"keywords": "machine learning, classification, regression, SVM, neural networks, deep learning, clustering, ensembles, reinforcement learning",
"content": [
{
"week_number": 1,
"topic": "Introduction to Machine Learning — Supervised vs. unsupervised learning, model evaluation"
},
{
"week_number": 2,
"topic": "Decision Trees — ID3, information gain, entropy, pruning"
},
{
"week_number": 3,
"topic": "k-Nearest Neighbors — Instance-based learning, distance metrics"
},
{
"week_number": 4,
"topic": "Linear Models I — Perceptron algorithm, linear separability"
},
{
"week_number": 5,
"topic": "Linear Models II — Linear regression, gradient descent, optimization"
},
{
"week_number": 6,
"topic": "Logistic Regression — Maximum likelihood estimation, regularization (L1/L2)"
},
{
"week_number": 7,
"topic": "Support Vector Machines — Linear SVMs, kernels, soft margins"
},
{
"week_number": 8,
"topic": "Neural Networks I — Multilayer perceptrons, backpropagation algorithm"
},
{
"week_number": 9,
"topic": "Neural Networks II — Deep learning basics, activation functions, training techniques"
},
{
"week_number": 10,
"topic": "Convolutional Neural Networks — CNNs, applications in computer vision"
},
{
"week_number": 11,
"topic": "Unsupervised Learning — K-means clustering, hierarchical clustering, GMMs, EM algorithm"
},
{
"week_number": 12,
"topic": "Dimensionality Reduction — PCA, feature selection"
},
{
"week_number": 13,
"topic": "Ensemble Methods — Bagging, random forests, boosting/AdaBoost"
},
{
"week_number": 14,
"topic": "Reinforcement Learning Introduction — Learning theory (PAC, VC dimension), course review"
}
]
},
{
"id": 14,
"code": "CMPE 360",
"name": "Computer Graphics",
"description": "This course offers a comprehensive introduction to the field of computer graphics, covering fundamental concepts, algorithms, and techniques for both two-dimensional and three-dimensional graphics. Advanced rendering techniques such as ray tracing is also introduced.",
"keywords": "computer graphics, 2D graphics, 3D graphics, transformations, OpenGL, shading, texturing, ray tracing",
"content": [
{
"week_number": 1,
"topic": "Introduction to Computer Graphics — History, applications, graphics pipeline, coordinate systems"
},
{
"week_number": 2,
"topic": "Linear Algebra Review and 2D Graphics — Vectors, matrices, rasterization (Bresenham's algorithm)"
},
{
"week_number": 3,
"topic": "2D Transformations — Translation, rotation, scaling, homogeneous coordinates"
},
{
"week_number": 4,
"topic": "3D Transformations — 3D coordinate systems, rotation matrices, Euler angles, quaternions"
},
{
"week_number": 5,
"topic": "Viewing and Projection — Camera models, orthographic and perspective projection"
},
{
"week_number": 6,
"topic": "Graphics Pipeline and OpenGL/WebGL — Modern pipeline, vertex and fragment processing"
},
{
"week_number": 7,
"topic": "Programmable Shaders — GLSL fundamentals, vertex shaders, fragment shaders"
},
{
"week_number": 8,
"topic": "Midterm Exam and Polygon Rendering — Scan conversion, clipping, hidden surface removal"
},
{
"week_number": 9,
"topic": "Illumination and Reflection Models — Phong reflection model (ambient, diffuse, specular)"
},
{
"week_number": 10,
"topic": "Shading Techniques — Flat, Gouraud, and Phong shading, per-pixel lighting"
},
{
"week_number": 11,
"topic": "Texture Mapping — Texture coordinates, filtering (mipmapping), bump mapping"
},
{
"week_number": 12,
"topic": "Advanced Rendering Techniques — Shadow mapping, deferred rendering, anti-aliasing"
},
{
"week_number": 13,
"topic": "Ray Tracing Fundamentals — Ray-object intersection, recursive ray tracing, acceleration structures"
},
{
"week_number": 14,
"topic": "Advanced Topics — Global illumination, GPU computing, final projects"
}
]
},
{
"id": 15,
"code": "CMPE 365",
"name": "Machine Translation",
"description": "The aim of this course is to teach primary concepts and programming skills about machine translation (MT) and train students who have fundamental understandings about MT applications. Students gain experience about coding with python and learn using python libraries effectively.",
"keywords": "machine translation, SMT, NMT, transformers, BLEU, evaluation, low-resource MT",
"content": [
{
"week_number": 1,
"topic": "Introduction to Machine Translation — History (rule-based, statistical, neural), evaluation challenges"
},
{
"week_number": 2,
"topic": "Linguistic Foundations — Morphology, word alignment problems"
},
{
"week_number": 3,
"topic": "Statistical Machine Translation I — Noisy channel model, IBM Models 1 and 2"
},
{
"week_number": 4,
"topic": "Statistical Machine Translation II — Phrase-based translation, language models"
},
{
"week_number": 5,
"topic": "MT Evaluation Metrics — BLEU, METEOR, TER, ROUGE, human evaluation"
},
{
"week_number": 6,
"topic": "Neural Network Foundations for MT — Word embeddings, encoder-decoder framework"
},
{
"week_number": 7,
"topic": "Sequence-to-Sequence Models — RNN/LSTM-based translation"
},
{
"week_number": 8,
"topic": "Attention Mechanisms — Bahdanau attention, Luong attention, visualization"
},
{
"week_number": 9,
"topic": "Transformer Architecture I — Self-attention, positional encoding, multi-head attention"
},
{
"week_number": 10,
"topic": "Transformer Architecture II — Complete transformer model, layer normalization"
},
{
"week_number": 11,
"topic": "Subword Tokenization — BPE, WordPiece, SentencePiece, handling rare words"
},
{
"week_number": 12,
"topic": "Advanced NMT Topics — Multilingual MT, zero-shot translation, transfer learning"
},
{
"week_number": 13,
"topic": "Low-Resource Machine Translation — Domain adaptation, back-translation"
},
{
"week_number": 14,
"topic": "Current Trends — Large language models for MT, quality estimation, project presentations"
}
]
},
{
"id": 16,
"code": "CMPE 323",
"name": "Operating Systems",
"description": "Operating systems play a fundamental role in the use of computers and are of enormous commercial importance. Contents include classification and structure of operating systems, storage media, memory management and dynamic storage strategies, scheduling algorithms, I/O and interrupt structures, protection and security.",
"keywords": "operating systems, processes, threads, scheduling, synchronization, deadlocks, virtual memory, file systems, security",
"content": [
{
"week_number": 1,
"topic": "Introduction to Operating Systems — History, OS roles, system calls, kernel vs. user mode"
},
{
"week_number": 2,
"topic": "Processes — Process concept, process states, PCB, context switching, process creation"
},
{
"week_number": 3,
"topic": "Threads — Thread models, user vs. kernel threads, multithreading, Pthreads programming"
},
{
"week_number": 4,
"topic": "CPU Scheduling — Scheduling criteria, algorithms (FCFS, SJF, priority, round-robin)"
},
{
"week_number": 5,
"topic": "Process Synchronization I — Critical section problem, Peterson's solution, mutex locks"
},
{
"week_number": 6,
"topic": "Process Synchronization II — Semaphores, classical problems (producer-consumer, dining philosophers)"
},
{
"week_number": 7,
"topic": "Deadlocks — Deadlock characterization, prevention, avoidance (Banker's algorithm), detection"
},
{
"week_number": 8,
"topic": "Memory Management — Address spaces, address binding, swapping, contiguous allocation, paging"
},
{
"week_number": 9,
"topic": "Virtual Memory — Demand paging, page faults, page replacement algorithms, thrashing"
},
{
"week_number": 10,
"topic": "Storage Management — Disk structure, disk scheduling (FCFS, SSTF, SCAN), RAID"
},
{
"week_number": 11,
"topic": "File Systems I — File concepts, access methods, directory structure, file sharing"
},
{
"week_number": 12,
"topic": "File Systems II — File system implementation, allocation methods, free-space management"
},
{
"week_number": 13,
"topic": "I/O Systems — I/O hardware, application I/O interface, interrupt handling, DMA"
},
{
"week_number": 14,
"topic": "Protection and Security — Access control, authentication, security threats, virtualization overview"
}
]
},
{
"id": 17,
"code": "CMPE 344",
"name": "Computer Architecture",
"description": "This course is the continuation of Digital Design course where logic gates, combinational and sequential circuits are studied. Starting from register design, memory design, ALU, datapath design are covered. Instruction set architecture with examples are covered. RISC and CISC architectures are reviewed.",
"keywords": "computer architecture, ISA, pipelines, hazards, caching, virtual memory, ILP, multiprocessors, GPUs",
"content": [
{
"week_number": 1,
"topic": "Introduction to Computer Architecture — Performance metrics, Amdahl's Law, ISA abstraction"
},
{
"week_number": 2,
"topic": "Instruction Set Architecture — RISC vs. CISC, MIPS/RISC-V instruction formats, addressing modes"
},
{
"week_number": 3,
"topic": "Digital Logic Review — Combinational logic, multiplexers, ALU design, sequential logic"
},
{
"week_number": 4,
"topic": "Single-Cycle Processor Design — Datapath components, control unit design, instruction execution"
},
{
"week_number": 5,
"topic": "Multi-Cycle Processor Design — Breaking instructions into stages, microprogrammed control"
},
{
"week_number": 6,
"topic": "Pipelining Fundamentals — 5-stage pipeline (IF, ID, EX, MEM, WB), throughput vs. latency"
},
{
"week_number": 7,
"topic": "Pipeline Hazards I — Structural hazards, data hazards, forwarding/bypassing, stalling"
},
{
"week_number": 8,
"topic": "Pipeline Hazards II — Control hazards, branch prediction (static and dynamic)"
},
{
"week_number": 9,
"topic": "Memory Hierarchy — Locality principles, cache basics, direct-mapped caches"
},
{
"week_number": 10,
"topic": "Advanced Caching — Set-associative caches, replacement policies, write policies"
},
{
"week_number": 11,
"topic": "Virtual Memory — Address translation, page tables, TLBs, page faults, memory protection"
},
{
"week_number": 12,
"topic": "Instruction-Level Parallelism — Superscalar processors, out-of-order execution, Tomasulo's algorithm"
},
{
"week_number": 13,
"topic": "Multiprocessors and Parallelism — SIMD, MIMD, cache coherence protocols (MESI)"
},
{
"week_number": 14,
"topic": "Advanced Topics — GPUs, VLIW architectures, power/energy considerations, course review"
}
]
},
{
"id": 18,
"code": "CMPE 321",
"name": "Network Programming",
"description": "This course looks at programming for network based systems. Subjects covered include network protocols, network traffic and security, distributed programming and emerging network technologies. The course includes practical network programming.",
"keywords": "network programming, sockets, TCP, UDP, concurrency, HTTP, RPC, distributed systems, security",
"content": [
{
"week_number": 1,
"topic": "Introduction to Network Programming — OSI and TCP/IP models, client-server paradigm"
},
{
"week_number": 2,
"topic": "Socket Programming Basics — Socket API, socket types, socket system calls"
},
{
"week_number": 3,
"topic": "TCP Client Programming — Creating TCP clients, connecting to servers, sending/receiving data"
},
{
"week_number": 4,
"topic": "TCP Server Programming — Iterative servers, connection handling, server design patterns"
},
{
"week_number": 5,
"topic": "UDP Programming — Connectionless communication, UDP client/server, sendto/recvfrom"
},
{
"week_number": 6,
"topic": "Network Byte Order and Addressing — Byte ordering, address structures, hostname resolution (DNS)"
},
{
"week_number": 7,
"topic": "I/O Multiplexing — select(), poll(), non-blocking I/O, event-driven programming, epoll"
},
{
"week_number": 8,
"topic": "Concurrent Servers I — Multi-process servers using fork(), process management"
},
{
"week_number": 9,
"topic": "Concurrent Servers II — Multi-threaded servers using Pthreads, thread synchronization, thread pools"
},
{
"week_number": 10,
"topic": "Application Protocols — HTTP protocol basics, building HTTP clients and servers"
},
{
"week_number": 11,
"topic": "Remote Procedure Calls — RPC concepts, gRPC/Protocol Buffers"
},
{
"week_number": 12,
"topic": "Distributed Systems Fundamentals — Distributed architectures, CAP theorem introduction"
},
{
"week_number": 13,
"topic": "Network Security Basics — SSL/TLS overview, secure sockets, authentication"
},
{
"week_number": 14,
"topic": "Advanced Topics — Raw sockets, multicast, network debugging (tcpdump, Wireshark), project presentations"
}
]
},
{
"id": 19,
"code": "CMPE 352",
"name": "Software Engineering",
"description": "This course aims to provide students with an introductory understanding of general problems in developing large-scale computer systems that require teamwork, and also the basic principles in planning for tools to develop such systems in economically feasible ways.",
"keywords": "software engineering, SDLC, agile, requirements, UML, architecture, testing, CI, project management",
"content": [
{
"week_number": 1,
"topic": "Introduction to Software Engineering and Software Development Lifecycle (SDLC)"
},
{
"week_number": 2,
"topic": "Software Process Models — Waterfall, iterative, spiral, V-Model"
},
{
"week_number": 3,
"topic": "Agile Methodologies — Scrum, Extreme Programming (XP)"
},
{
"week_number": 4,
"topic": "Requirements Engineering — Elicitation techniques"
},
{
"week_number": 5,
"topic": "Requirements Specification and Use Case Modeling"
},
{
"week_number": 6,
"topic": "System Modeling with UML — Class, sequence, state diagrams"
},
{
"week_number": 7,
"topic": "Software Architecture and Architectural Patterns"
},
{
"week_number": 8,
"topic": "Design Principles — SOLID, coupling, cohesion, and design patterns"
},
{
"week_number": 9,
"topic": "Version Control Systems (Git) and Configuration Management"
},
{
"week_number": 10,
"topic": "Software Testing Fundamentals — Unit, integration, system testing"
},
{
"week_number": 11,
"topic": "Test-Driven Development and Continuous Integration"
},
{
"week_number": 12,
"topic": "Code Reviews, Static Analysis, and Quality Assurance"
},
{
"week_number": 13,
"topic": "Project Management, Risk Management, and Estimation"
},
{
"week_number": 14,
"topic": "Software Evolution, Maintenance, and DevOps Practices"
}
]
},
{
"id": 20,
"code": "CMPE 443",
"name": "Business Intelligence and Analytics",
"description": "This course covers Business Intelligence as a concept of data collection and management to support wide variety of management tasks and Business Analytics as an extensive use of data analysis methods have gained great importance to drive fact-based decisions and actions.",
"keywords": "business intelligence, data warehousing, OLAP, dashboards, KPIs, visualization, predictive analytics, governance",
"content": [
{
"week_number": 1,
"topic": "Introduction to Business Intelligence — BI concepts, decision support systems, BI lifecycle"
},
{
"week_number": 2,
"topic": "Data Warehousing Fundamentals — OLTP vs. OLAP, data warehouse architecture, data marts"
},
{
"week_number": 3,
"topic": "Dimensional Modeling — Facts, dimensions, measures, star schema, slowly changing dimensions"
},
{
"week_number": 4,
"topic": "ETL for Data Warehouses — Extraction strategies, transformation, loading techniques"
},
{
"week_number": 5,
"topic": "OLAP and Multidimensional Analysis — OLAP cubes, drill-down, roll-up, slice, dice"
},
{
"week_number": 6,
"topic": "SQL for Analytics — Advanced SQL, window functions, OLAP extensions"
},
{
"week_number": 7,
"topic": "Introduction to BI Tools — Overview of Tableau, Power BI, Looker"
},
{
"week_number": 8,
"topic": "Midterm Exam and Review"
},
{
"week_number": 9,
"topic": "Data Visualization Principles — Visual encoding, chart selection, dashboard design"
},
{
"week_number": 10,
"topic": "Building Interactive Dashboards — Filters, parameters, calculated fields"
},
{
"week_number": 11,
"topic": "Reporting and KPIs — Report design, key performance indicators, scorecards"
},
{
"week_number": 12,
"topic": "Advanced Analytics — Predictive analytics introduction, trend analysis, forecasting"
},
{
"week_number": 13,
"topic": "Data Quality and Governance in BI — Data quality dimensions, master data management"
},
{
"week_number": 14,
"topic": "BI Strategy and Final Project Presentations — Analytics maturity models"
}
]
},
{
"id": 21,
"code": "CMPE 461",
"name": "Natural Language Processing",
"description": "Natural Language Processing (NLP) which is sub-brunch of Artificial intelligence, aims to develop techniques for processing language and speech. The course aims to learn basic algorithms in this field and the main language levels: morphology, syntax, semantics, and pragmatics.",
"keywords": "natural language processing, word embeddings, language models, parsing, RNNs, transformers, sentiment analysis, QA",
"content": [
{
"week_number": 1,
"topic": "Introduction to NLP — Language and computation, regular expressions, text normalization"
},
{
"week_number": 2,
"topic": "Word Representations I — Word vectors and Word2Vec (Skip-gram, CBOW)"
},
{
"week_number": 3,
"topic": "Word Representations II — GloVe, word embeddings evaluation and applications"
},
{
"week_number": 4,
"topic": "Text Classification — Neural network foundations (feedforward networks for NLP)"
},
{
"week_number": 5,
"topic": "N-gram Language Models — Perplexity, smoothing techniques"
},
{
"week_number": 6,
"topic": "Part-of-Speech Tagging — HMMs, Viterbi algorithm, CRFs"
},
{
"week_number": 7,
"topic": "Syntactic Parsing I — Constituency parsing (CFGs, CKY algorithm)"
},
{
"week_number": 8,
"topic": "Syntactic Parsing II — Dependency parsing (transition-based and graph-based)"
},
{
"week_number": 9,
"topic": "Recurrent Neural Networks — RNNs, LSTMs, GRUs for sequence modeling"
},
{
"week_number": 10,
"topic": "Sequence-to-Sequence Models — Encoder-decoder architectures"
},
{
"week_number": 11,
"topic": "Attention Mechanisms and Transformers — Self-attention, multi-head attention"
},
{
"week_number": 12,
"topic": "Pre-trained Language Models — BERT, GPT, transfer learning for NLP"
},
{
"week_number": 13,
"topic": "Sentiment Analysis and Opinion Mining — Named entity recognition"
},
{
"week_number": 14,
"topic": "Question Answering — Coreference resolution, course review"
}
]
},
{
"id": 22,
"code": "CMPE 324",
"name": "Database Systems",
"description": "Almost all large data processing systems rely on a generalized database to store and retrieve data. Course contents include introduction to databases, entity relationship model, physical database design and access strategies, relational data model, SQL data manipulation language, normal forms and logical database design.",
"keywords": "database systems, relational model, SQL, storage, indexing, query processing, transactions, recovery, distributed databases",
"content": [
{
"week_number": 1,
"topic": "Course Introduction and Relational Model — Database concepts, relational algebra"
},
{
"week_number": 2,
"topic": "Modern SQL — Aggregation, joins, nested queries, common table expressions"
},
{
"week_number": 3,
"topic": "Database Storage I — Disk-based architecture, file organization, page layout"
},
{
"week_number": 4,
"topic": "Database Storage II — Log-structured storage, storage models, data compression"
},
{
"week_number": 5,
"topic": "Memory Management — Buffer pool manager, replacement policies (LRU, Clock)"
},
{
"week_number": 6,
"topic": "Hash Tables and Indexing I — Static and dynamic hashing, extendible hashing"
},
{
"week_number": 7,
"topic": "Indexing II — B+ Trees — Structure, operations (insert, delete, search)"
},
{
"week_number": 8,
"topic": "Midterm Exam"
},
{
"week_number": 9,
"topic": "Query Processing I — Sorting algorithms, aggregation, join algorithms"
},
{
"week_number": 10,
"topic": "Query Processing II — Hash joins, query execution models"
},
{
"week_number": 11,
"topic": "Query Optimization — Cost-based optimization, selectivity estimation"
},
{
"week_number": 12,
"topic": "Transaction Processing — ACID properties, two-phase locking, deadlock handling"
},
{
"week_number": 13,
"topic": "Multi-Version Concurrency Control and Recovery — MVCC, ARIES recovery algorithm"
},
{
"week_number": 14,
"topic": "Distributed Databases — Distributed architectures, OLTP vs. OLAP, course wrap-up"
}
]
},
{
"id": 23,
"code": "CMPE 460",
"name": "Artificial Intelligence",
"description": "Artificial intelligence (AI) has become an important field of study with a wide spread of applications. In this module we will investigate questions about AI systems such as: how to represent knowledge, how to effectively generate appropriate sequences of actions and how to search among alternatives to find optimal solutions.",
"keywords": "artificial intelligence, search, CSPs, game playing, MDPs, reinforcement learning, probabilistic reasoning, logic, planning",
"content": [
{
"week_number": 1,
"topic": "Introduction to AI — History, applications, and intelligent agents"
},
{
"week_number": 2,
"topic": "Search Algorithms I — Uninformed search (BFS, DFS, uniform cost search)"
},
{
"week_number": 3,
"topic": "Search Algorithms II — Informed search (A*, heuristics, admissibility)"
},
{
"week_number": 4,
"topic": "Constraint Satisfaction Problems — CSP formulation, backtracking, arc consistency"
},
{
"week_number": 5,
"topic": "Game Playing I — Adversarial search (minimax algorithm)"
},
{
"week_number": 6,
"topic": "Game Playing II — Alpha-beta pruning, evaluation functions, Monte Carlo tree search"
},
{
"week_number": 7,
"topic": "Markov Decision Processes — MDPs, Bellman equations, value iteration"
},
{
"week_number": 8,
"topic": "Reinforcement Learning — Policy iteration, Q-learning, exploration vs. exploitation"
},
{
"week_number": 9,
"topic": "Probabilistic Reasoning I — Bayesian networks (structure, conditional independence)"
},
{
"week_number": 10,
"topic": "Probabilistic Reasoning II — Inference in Bayesian networks (variable elimination)"
},
{
"week_number": 11,
"topic": "Hidden Markov Models — Forward algorithm, Viterbi algorithm"
},
{
"week_number": 12,
"topic": "Knowledge Representation and Propositional Logic"
},
{
"week_number": 13,
"topic": "First-Order Logic — Syntax, semantics, inference, unification"
},
{
"week_number": 14,
"topic": "Planning and Review — STRIPS, forward/backward planning, course summary"
}
]
},
{
"id": 24,
"code": "CMPE 493",
"name": "Cloud Computing",
"description": "Aim of this course are introduce the basics of the emerging cloud computing paradigms and implement basic cloud related applications. Students will familiarize with distributed system models and enabling technologies; virtual machines and virtualization of clusters, networks and data centers.",
"keywords": "cloud computing, virtualization, containers, distributed systems, storage, networking, AWS, Azure, GCP, security",
"content": [
{
"week_number": 1,
"topic": "Introduction to Cloud Computing — Cloud definition, characteristics (NIST), cloud economics"
},
{
"week_number": 2,
"topic": "Cloud Service Models Deep Dive — IaaS, PaaS, SaaS, emerging models (BaaS, FaaS)"
},
{
"week_number": 3,
"topic": "Cloud Deployment Models — Public, private, hybrid, multi-cloud strategies"
},
{
"week_number": 4,
"topic": "Virtualization Technologies — Hypervisors (Type 1, Type 2), virtual machines, live migration"
},
{
"week_number": 5,
"topic": "Container Technologies — Containers vs. VMs, Docker internals, container runtimes"
},
{
"week_number": 6,
"topic": "Distributed Systems Fundamentals — CAP theorem, consistency models, Paxos, Raft"
},
{
"week_number": 7,
"topic": "Cloud Storage Systems — Object storage, block storage, distributed file systems, CDNs"
},
{
"week_number": 8,
"topic": "Midterm Exam and Cloud Networking — Software-defined networking, VPCs, load balancing"
},
{
"week_number": 9,
"topic": "Scalability and Elasticity — Auto-scaling, horizontal vs. vertical scaling, cost optimization"
},
{
"week_number": 10,
"topic": "AWS Core Services — EC2, S3, RDS, VPC, IAM, Lambda"
},
{
"week_number": 11,
"topic": "Microsoft Azure Core Services — Azure VMs, Blob Storage, Azure SQL, Virtual Networks"
},
{
"week_number": 12,
"topic": "Google Cloud Platform and Multi-Cloud — GCP Compute Engine, BigQuery, multi-cloud management"
},
{
"week_number": 13,
"topic": "Cloud Security — Identity and access management, encryption, shared responsibility model"
},
{
"week_number": 14,
"topic": "Emerging Trends — Edge computing, serverless architectures, cloud-native patterns, final project"
}
]
},
{
"id": 25,
"code": "CMPE 451",
"name": "User Interface Design",
"description": "This course aims to provide students with a general appreciation of the art of user interface design, particularly graphical user interfaces in computer and software systems with a target of Full Stack Development. It provides extensive case scenarios and examples of bad design.",
"keywords": "HCI, user-centered design, user research, prototyping, visual design, usability, accessibility, mobile UI",
"content": [
{
"week_number": 1,
"topic": "Introduction to HCI and User-Centered Design Principles"
},
{
"week_number": 2,
"topic": "Human Factors — Perception, cognition, and memory in interface design"
},
{
"week_number": 3,
"topic": "User Research Methods — Interviews, observation, contextual inquiry"
},
{
"week_number": 4,
"topic": "Needfinding, Task Analysis, and User Requirements"
},
{
"week_number": 5,
"topic": "Personas, Scenarios, and User Journey Mapping"
},
{
"week_number": 6,
"topic": "Conceptual Models and Interaction Design Frameworks"
},
{
"week_number": 7,
"topic": "Paper Prototyping and Low-Fidelity Wireframing"
},
{
"week_number": 8,
"topic": "Visual Design Principles — Layout, typography, color, hierarchy"
},
{
"week_number": 9,
"topic": "Digital Prototyping — Interactive mockups with Figma/Sketch"
},
{
"week_number": 10,
"topic": "Usability Evaluation — Heuristic evaluation and cognitive walkthrough"
},
{
"week_number": 11,
"topic": "User Testing Methods — Think-aloud protocols and A/B testing"
},
{
"week_number": 12,
"topic": "Accessibility and Inclusive Design — WCAG guidelines"
},
{
"week_number": 13,
"topic": "Mobile and Responsive Interface Design"
},
{
"week_number": 14,
"topic": "Emerging Interfaces — Voice UI, gesture, future of HCI"
}
]
},
{
"id": 26,
"code": "CMPE 482",
"name": "Cryptography",
"description": "This course is on the applications of real world cryptography. It covers fundamental aspects of secure communication and modern implications of privacy by introducing basic and advanced methods of cryptography. Necessary theoretical concepts from number theory, finite fields, elliptic curves are covered.",
"keywords": "cryptography, symmetric, asymmetric, AES, MAC, hash functions, Diffie-Hellman, RSA, digital signatures, PKI, TLS, post-quantum",
"content": [
{
"week_number": 1,
"topic": "Introduction to Cryptography and Historical Ciphers"
},
{
"week_number": 2,
"topic": "Perfect Secrecy — One-time pad, stream ciphers"
},
{
"week_number": 3,
"topic": "Block Ciphers and the Advanced Encryption Standard (AES)"
},
{
"week_number": 4,
"topic": "Modes of Operation — ECB, CBC, CTR, semantic security"
},
{
"week_number": 5,
"topic": "Message Authentication Codes (MAC) and HMAC"
},
{
"week_number": 6,
"topic": "Cryptographic Hash Functions — SHA family, Merkle-Damgård construction"
},
{
"week_number": 7,
"topic": "Authenticated Encryption and AEAD Modes"
},
{
"week_number": 8,
"topic": "Number Theory Foundations for Public-Key Cryptography"
},
{
"week_number": 9,
"topic": "Diffie-Hellman Key Exchange and Discrete Logarithm Problem"
},
{
"week_number": 10,
"topic": "RSA Encryption and the Factoring Assumption"
},
{
"week_number": 11,
"topic": "Digital Signatures — RSA, DSA, ECDSA"
},
{
"week_number": 12,
"topic": "Public Key Infrastructure and Certificate Management"
},
{
"week_number": 13,
"topic": "Cryptographic Protocols and TLS/SSL"
},
{
"week_number": 14,
"topic": "Post-Quantum Cryptography and Zero-Knowledge Proofs"
}
]
},
{
"id": 27,
"code": "CMPE 483",
"name": "Computer Security and Digital Forensics",
"description": "This course introduces students to the fundamentals of computer system security and digital forensics. Emphasis is placed on identifying threats to, and vulnerabilities of, computer systems and how to minimize them. Students will learn how hackers identify victims and how attacks are executed.",
"keywords": "computer security, vulnerabilities, exploits, malware, network security, web security, digital forensics, incident response",
"content": [
{
"week_number": 1,
"topic": "Introduction to Computer Security — Threat modeling, security principles"
},
{
"week_number": 2,
"topic": "Vulnerabilities and Attack Surfaces — Buffer overflows and memory safety"
},
{
"week_number": 3,
"topic": "Control-Flow Attacks — Return-oriented programming and defenses"
},
{
"week_number": 4,
"topic": "Malware Types — Analysis techniques and defense mechanisms"
},
{
"week_number": 5,
"topic": "Network Security Fundamentals and Protocol Vulnerabilities"
},
{
"week_number": 6,
"topic": "Intrusion Detection Systems and Network Monitoring"
},
{
"week_number": 7,
"topic": "Web Security — SQL injection, XSS, CSRF, secure coding"
},
{
"week_number": 8,
"topic": "Authentication, Authorization, and Access Control Models"
},
{
"week_number": 9,
"topic": "Introduction to Digital Forensics — Principles and legal framework"
},
{
"week_number": 10,
"topic": "Evidence Collection — Preservation and chain of custody"
},
{
"week_number": 11,
"topic": "Disk Forensics — File systems, data recovery, analysis tools"
},
{
"week_number": 12,
"topic": "Memory Forensics and Live System Analysis"
},
{
"week_number": 13,
"topic": "Incident Response — Detection, containment, eradication, recovery"
},
{
"week_number": 14,
"topic": "Forensic Reporting — Expert testimony and case studies"
}
]
}
]
}